总结：
一：print  println 区别

二：进制（了解）  逢几进几 就是对应的进制

    二进制： 计算机底层存储数据时 采用的就是二进制的方式
	 
	10进制的数 ==》 二进制
	
	二进制的数 ==》 十进制
	
三：java数据类型 *******
       
	   
	   引用数据类型：除了基本数据类型 都是引用数据类型 String

       基本数据类型:
	          1byte  = 8bit;
			  1024byte  = 1KB;
			  1024kb = 1MB;
			  .....
	   
			整数型：
			     byte    1      杯子
				 short   2      水壶
				 int     4      锅
				 long    8      缸
			    默认是 int 
				声明long类u型的变量 + L/l
			浮点型：
				float    4      洒水车 f/F
				double   8      水库
				默认是 double
				
			
			字符型：
			    char     2      盆
				存储单个字符
				 
			布尔型：
			     boolean 1bit
四：类型转换

     1.自动类型提升


     2.强制类型转换	 
	    
		小的数据类型 标识符 = （小的数据类型）大的数据类型的数值；
				 
五：运算符  *******

   1.算数运算符 
      求一个四位数每一个位上的数字
	  ++ --;
	  a++;
	  ++a;
	  
	2.赋值运算符
	  += -= *= /= %= 
	  
	  byte b = 20;
	    byte b1 = 20;
		byte b3 = b + b1;//报错
		b+=b1;//不报错
		
	3.比较运算符 
	   
	4. 三目运算符
	
	
逻辑运算符 预习一下
         